Revit 2026 API

# PrinterResolution Enumeration

---

Controls the resolution level in rendering settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PrinterResolution
```
```vb
Public Enumeration PrinterResolution
```
```cpp
public enum class PrinterResolution
```
```fsharp
type PrinterResolution
```

| Member name | Value | Description |
| --- | --- | --- |
| High | 2 | High printer resolution. |
| Low | 0 | Low printer resolution. |
| Medium | 1 | Medium printer resolution. |
| VeryHigh | 3 | VeryHigh printer resolution. |

It is applicable only when using printer resolution. The suitable resolution value for each resolution level is decided by default in Revit.

#### Reference

Autodesk.Revit.DB Namespace